# SummaryShowsOnlyConnectedLoads Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData..::..SummaryShowsOnlyConnectedLoads Property
PanelScheduleData Class See Also
---
Show only the connected load classifications in the summary section
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool SummaryShowsOnlyConnectedLoads { get; set; }
```

Visual Basic
---
```text
Public Property SummaryShowsOnlyConnectedLoads As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool SummaryShowsOnlyConnectedLoads {
	bool get ();
	void set (bool value);
}
```

# See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace